import random
j = 0
i = 0
stan = []
winner = [1]
love = ["トウカイテイオー", "メジロマックイーン", "サイレンススズカ", "スペシャルウィーク", "ゴールドシップ", "セイウンスカイ", "ナイスネイチャ", 
 "タマモクロス", "キタサンブラック", "シンボリルドルフ", "エアグルーヴ", "ダイワスカーレット", "ウオッカ", "カレンチャン", "サトノダイヤモンド", "ナリタタイシン",
 "マルゼンスキー", "フジキセキ", "オグリキャップ", "タイキシャトル", "グラスワンダー", "ヒシアマゾン", "エレコンドルパサー", "テイエムオペラオー", "ナリタブライアン", "アグネスデジタル", "ファインモーション", "ビワハヤヒデ", "マヤノトップガン", "マンハッタンカフェ", "ミホノブルボン", "メジロライアン", "ヒシアケボノ", "ユキノビジン", "ライスシャワー", "アイネスウフウジン", "アグネスタキオン", "アドマイヤベガ", "イナリワン", "ウイニングチケット", "エアシャカール", "エンシンフラッシュ", "カワカミプリンセス", "ゴールドシチー", "サクラバクシンオー", "シーキングザバール", "シンコウウインディ", "スイープトウショウ", "スーパークリーク", "スマートファルコン", "ゼンノロブロイ", "トウセンジョーダン", "ナカヤマフェスタ", "ニシノフラワー", "ハルウララ", "バンブーメモリ", "ビコーペガサス", "マーベラスサンデー", "マチカネフクキタル", "ミスターシービー", "メイショウドトウ", "メジロドーベル", "キングへイロー", "マチカネタンホイザ", "イクノディクタス", "メジロパーマ", "ダイタクヘリオス", "ツインターボ", "メジロアルダン", "サクラチヨノオー", "シリウスシンボリ", "ヤエノムテキ", "メジロブライト","桐生院葵"]
input("有馬記念")
input("出走ウマ娘")
print("-" * 30)

for t in range(16):
    stay = random.choice(love)
    love.remove(stay)
    stan.append(stay)
    j += 1
    print(f"{j:>3}番人気　{stay}")

print("-" * 30)

while True:
    try:
        hit = input("予想：")
        if hit == 'q':
            exit()
        pos = stan.index(hit)
        break    
    except ValueError:
        print("登録にないウマ娘です。")
        continue

print("-" * 30)

for win in range(16):
    result = random.choice(stan)
    stan.remove(result)
    i += 1
    print(f"{i:>3}着　{result}")
    if i == 1:
        winner = result

print("-" * 30)

if hit == winner:
   print("当たり")
else:
    print("残念")
